In [ ]:
import csv
with open(file='try.csv',mode='r') as f:
    reader =csv.reader(f)
    for row in reader:
        print(row)

['Name', 'Address', 'Age']
['Ram', 'Biratnagar', '22']
['shyam', 'ithari', '23']
['hari', 'dharan', '21']

In [4]:
import csv
with open(file='try.csv',mode='r') as f:
    reader =csv.DictReader(f)
    for row in reader:
        print(row["Name"],' ',row["Address"])

Ram   Biratnagar
shyam   ithari
hari   dharan

In [5]:
import csv
with open(file='try.csv',mode='r') as f:
    reader =csv.DictReader(f)
    for row in reader:
        print(row)

{'Name': 'Ram', 'Address': 'Biratnagar', 'Age': '22'}
{'Name': 'shyam', 'Address': 'ithari', 'Age': '23'}
{'Name': 'hari', 'Address': 'dharan', 'Age': '21'}

In [8]:
import csv
data=[
    ['Name', 'Address', 'Age'],
    ['Ram', 'Biratnagar', 22],
    ['shyam', 'ithari', 23],
    ['hari', 'dharan', 21]
]
with open(file="New.csv",mode="w",newline="") as f:
    writer=csv.writer(f)
    writer.writerows(data)

In [15]:
import csv
data=[
    {'Name': 'Ram', 'Address': 'Biratnagar', 'Age': '22'},
{'Name': 'shyam', 'Address': 'ithari', 'Age': '23'},
{'Name': 'hari', 'Address': 'dharan', 'Age': '21'},
    
]
with open(file="new1.csv",mode="w",newline="") as f:
    writer=csv.DictWriter(f,fieldnames=["Name","Address","Age"])
    writer.writeheader()
    writer.writerows(data)

In [17]:
import pandas as pd
df=pd.read_csv("new1.csv")#(new.csv,usecols=in case we dont have columns
print(df.to_string(index=False))
print(type(df))

 Name    Address  Age
  Ram Biratnagar   22
shyam     ithari   23
 hari     dharan   21
<class 'pandas.core.frame.DataFrame'>

In [20]:
df["Name"]

0      Ram
1    shyam
2     hari
Name: Name, dtype: object

In [21]:
#Display the info of the file 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Address  3 non-null      object
 2   Age      3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [22]:
df.head(
    
)

    Name     Address  Age
0    Ram  Biratnagar   22
1  shyam      ithari   23
2   hari      dharan   21

In [23]:
df.tail()

    Name     Address  Age
0    Ram  Biratnagar   22
1  shyam      ithari   23
2   hari      dharan   21

In [ ]:
df.tail(2)

    Name Address  Age
1  shyam  ithari   23
2   hari  dharan   21

In [26]:
#view the random sample
df.sample()

    Name Address  Age
1  shyam  ithari   23

In [28]:
#check for the missing values
df.isnull().sum()

Name       0
Address    0
Age        0
dtype: int64

In [29]:
df["Province"]="Koshi"

In [30]:
print(df)

    Name     Address  Age Province
0    Ram  Biratnagar   22    Koshi
1  shyam      ithari   23    Koshi
2   hari      dharan   21    Koshi

In [31]:
#write csv
df.to_csv("new1.csv",index=False)

In [32]:
dataframe=pd.DataFrame([
{"Roll":1,"Name":"Ram","Eng":80,"Math":81,"science":82},
{"Roll":2,"Name":"shyam","Eng":79,"Math":80,"science":83},
])
print(dataframe)

   Roll   Name  Eng  Math  science
0     1    Ram   80    81       82
1     2  shyam   79    80       83

In [33]:
dataframe['Total']=dataframe['Eng']+dataframe['Math']+dataframe["science"]
print(dataframe)

   Roll   Name  Eng  Math  science  Total
0     1    Ram   80    81       82    243
1     2  shyam   79    80       83    242

In [34]:
dataframe['Percentage']=(dataframe['Total']/3).round(decimals=3)
print(dataframe)

   Roll   Name  Eng  Math  science  Total  Percentage
0     1    Ram   80    81       82    243      81.000
1     2  shyam   79    80       83    242      80.667

In [35]:
#JSON (javascript Object Notation)
import json
with open("data.json","r") as f:
    data=json.load(f)
print(data)

{'name': 'bob', 'age': 30, 'skills': ['pyhton', 'ML']}

In [37]:
import pprint
print(pprint.pprint(data))

{'age': 30, 'name': 'bob', 'skills': ['pyhton', 'ML']}
None

In [38]:

data={
    "Name":"Angel",
    "age":30,
    "skills":["act like straight"]
}
with open("data.json","w") as f:
    json.dump(data,f,indent=4)